# What is Pandas
python library for data manipulation and analysis

In [31]:
import pandas as pd

In [32]:
data_frame = pd.read_csv('data/friend_list.csv')

In [33]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# What is DataFrame?
dataframe is a 2-dimensional labeled data structure with columns

In [34]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [35]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

# What is Series?
Every Single column in dataframe is series

In [36]:
type(data_frame.name)

pandas.core.series.Series

In [37]:
type(data_frame.age)

pandas.core.series.Series

In [38]:
type(data_frame.job)

pandas.core.series.Series

In [39]:
list_tmp = [1, 2, 3]

In [40]:
list_tmp

[1, 2, 3]

In [41]:
s1 = pd.core.series.Series( [1, 2, 3] )

In [42]:
s2 = pd.core.series.Series( ['one', 'two', 'three' ] )

In [45]:
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

In [46]:
df = pd.read_csv('data/friend_list.csv')

In [47]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [48]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [49]:
df = pd.read_csv('data/friend_list.txt')

In [50]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [51]:
df = pd.read_csv('data/friend_list_tab.txt')

In [52]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [53]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter='\t')

In [54]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [55]:
df = pd.read_csv('data/friend_list_no_head.csv')

In [56]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [57]:
df = pd.read_csv('data/friend_list_no_head.csv', header=None)

In [58]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [59]:
df.columns = ['name', 'age', 'job']

In [60]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [61]:
df = pd.read_csv('data/friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])

In [62]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# Create DataFrame
when you want to create dataframe from your python code

## from dictionary

In [63]:
friend_dict_list = [
    {'name':'Jone', 'age':25, 'job':'student'},
    {'name':'Nate', 'age':30, 'job':'teacher'}
]

In [64]:
df = pd.DataFrame(friend_dict_list)

In [65]:
df

   age      job  name
0   25  student  Jone
1   30  teacher  Nate

In [66]:
df = df[['name', 'age', 'job']]

In [67]:
df

   name  age      job
0  Jone   25  student
1  Nate   30  teacher

## from OrderedDict

In [68]:
from collections import OrderedDict

In [70]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['Jone', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [71]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [72]:
df

   name  age      job
0  Jone   25  student
1  Nate   30  teacher

## from list

In [73]:
friend_list = [
    ['Jone', 25, 'studnet'],
    ['Nate', 30, 'teacher']
]

In [74]:
column_name = ['name', 'age', 'job']

In [75]:
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [76]:
df

   name  age      job
0  Jone   25  studnet
1  Nate   30  teacher

In [77]:
friend_list = [
        ['name', ['Jone', 'Nate']],
        ['age', [25, 30]],
        ['job', ['student', 'teacher']]
]

In [78]:
df = pd.DataFrame.from_items(friend_list)

In [79]:
df

   name  age      job
0  Jone   25  student
1  Nate   30  teacher

# Write DataFrame to File
here is one dataframe example with header

In [84]:
friends = [
    {'name': 'Jone', 'age': 20, 'job': 'studenet'},
    {'name': 'Jenny', 'age': 30, 'job': None},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]
df = pd.DataFrame.from_dict(friends)
df = df[['name', 'age', 'job']]

In [85]:
df

    name  age       job
0   Jone   20  studenet
1  Jenny   30      None
2   Nate   30   teacher

In [87]:
df.to_csv('friends.csv', index=False, header=False, na_rep='-')

# Select Row
## by index

In [99]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [100]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [101]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [103]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

## by column condition

In [104]:
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [106]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [107]:
df[ (df.age>25) & (df.name=='Nate') ]

   name  age      job
2  Nate   30  teacher

# Filter Column
## by index

In [108]:
friend_list = [
    ['Jone', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)

In [109]:
df

       0   1          2
0   Jone  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [110]:
df.iloc[:,0:2]

       0   1
0   Jone  20
1  Jenny  30
2   Nate  30

## by column name

In [111]:
df = pd.read_csv('data/friend_list_no_head.csv', header=None, names=['name','age','job'])

In [112]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [113]:
df_filtered = df[['name','age']]

In [114]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [115]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [119]:
# select columns containing 'a' from axis=1(: column names row)
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [121]:
# select columns using regex
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [122]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

# Drop rows
## by row name (index name)

In [125]:
friends = [
    {'age':15,'job':'student'},
    {'age':25,'job':'developer'},
    {'age':30,'job':'teacher'}
]

df = pd.DataFrame(friends,
                 index=['Jone','Jenny','Nate'],
                 columns=['age','job'])

In [126]:
df

       age        job
Jone    15    student
Jenny   25  developer
Nate    30    teacher

In [127]:
df.drop(['Jone','Nate'])

       age        job
Jenny   25  developer

In [128]:
df

       age        job
Jone    15    student
Jenny   25  developer
Nate    30    teacher

In [129]:
df.drop(['Jone','Nate'], inplace=True)

In [130]:
df

       age        job
Jenny   25  developer

In [131]:
friends = [
    {'name':'Jone','age':15,'job':'student'},
    {'name':'Ben','age':25,'job':'developer'},
    {'name':'Jenny','age':30,'job':'teacher'}
]

df = pd.DataFrame(friends, columns=['name','age','job'])

In [132]:
df

    name  age        job
0   Jone   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [133]:
df = df.drop(df.index[[0,2]])

In [134]:
df

  name  age        job
1  Ben   25  developer

In [135]:
df = pd.DataFrame(friends, columns=['name','age','job'])

In [136]:
df

    name  age        job
0   Jone   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [137]:
df = df[df.age > 20]

In [138]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [139]:
df = pd.DataFrame(friends, columns=['name','age','job'])

In [140]:
df

    name  age        job
0   Jone   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [141]:
df = df.drop('age', axis=1)

In [142]:
df

    name        job
0   Jone    student
1    Ben  developer
2  Jenny    teacher

In [143]:
df = pd.DataFrame(friends, columns=['name','age','job'])

In [144]:
df

    name  age        job
0   Jone   15    student
1    Ben   25  developer
2  Jenny   30    teacher